#!/usr/bin/python3
# -*- coding: utf-8 -*-

import unittest

def getExpectedTranscription(inp):
    '''Ця функція повертає очікувану транскрипцію
    @param input Вхідний рядок з наголосом, наприклад щаве!ль
    @returns Очікувану транскрипцію, наприклад шчаве!л'
    '''

    return inp

class TestExpectedTranscription(unittest.TestCase):

    def performTest(self, pairs):
        for i, o in pairs.items():
            self.assertEqual(o, getExpectedTranscription(i), 'Вхідне слово: "' + i + '"')

    def test_a_basic(self):
        pairs = {
            'ша!пка': 'ша!пка',
        }
        self.performTest(pairs)

    def test_o_basic(self):
        pairs = {
            'вода!': 'вода!',
            'моту!зка': 'моу^ту!зка',
        }
        self.performTest(pairs)

    def test_o_complex(self):
        # не виявляє оу^ однокурсник, бордюр, рвонути, красоту
        pairs = {
            'одноку!рсник': 'о*дноку!рсние^к',
            # Про слова іншомовного походжження словник 2001 не знає... 
            #'бордю!р': 'борд\'ур',
            # Про це також... 
            #'добу!ти': 'добу!ти',
        }
        self.performTest(pairs)

    def test_2001_o_before_stressed_i(self):
        # Увага! Це суперечить словнику Погрібного, проте так зроблено в словнику 2001
        pairs = {
            'порі!г': 'поу^ріг'
        }
        self.performTest(pairs)

    def test_u_basic(self):
        pairs = {
            'кугуа!р': 'кугуа!р',

            # у -> у~
            'аудито!рія': 'ау~дито!рійа',
        }
        self.performTest(pairs)

    def test_i_basic(self):
        pairs = {
            'дід': 'д\'ід',
            'істо!та': 'істо!та',
        }
        self.performTest(pairs)

    def test_i_to_y_1(self):
        pairs = {
            'і!ноді': 'і!и^ноді',
            'і!нколи': 'і!и^нколи',
            'і!нший': 'і!и^нший',
            'і!нде': 'і!и^нде',
        }
        self.performTest(pairs)

    # Немає у 2001
#    def test_i_to_y_2(self):
#        pairs = {
#            'си!ній': 'си!н\'іи^й',
#            'си!нім': 'си!н\'ім',
#            'мої!ми': 'мойі!и^ми',
#            'мої!м': 'мойі!м',
#            'краї!на': 'крайі!и^на'
#        }
#        self.performTest(pairs)

    def test_e_basic(self):
        pairs = {
            'сте!жка': 'сте!жка',
            'епо!ха': 'епо!ха',
            'по!ле': 'по!ле',
            'верба!a': 'веи^рба!',
            'прему!дрий': 'преи^му!дрий',
            'перли!на': 'пеи^рли!на',
            'неді!йсний': 'неи^ді!йсний',
        }
        self.performTest(pairs)

    def test_e_complex(self):
        pairs = {
            'теплоте!хніка': 'те*плоте!хні\'іка',
            'по!лем': 'поле!м',
            'болезаспокі!йливий': 'бо*лезаспок\'і!йлие^вий',
            # 2001 не знає:
            #'вечі!рка': 'вие^ч`і!рка',
        }
        self.performTest(pairs)

    def test_e_to_yi(self):
        pairs = {
            'за!єць': 'за!йі^ц\'',
        }
        self.performTest(pairs)

    def test_y_basic(self):
        pairs = {
            'ти!хо': 'ти!хо',
            'жва!вий': 'жва!вий',
            'прийти!': 'прийти!',
            'до!брих': 'до!брих',
            'роби!ти': 'роби!ти',
            'сидимо!': 'сие^дие^мо!',
            # 2001 не знає:
            #'виде!лка': 'веи^де!лка',
        }
        self.performTest(pairs)

    def test_y_complex(self):
        pairs = {
            'широкоря!дна': 'ши*рокор`а!дна',
            'пʼятиде!нний': 'пйатие^де!н:ий',
        }
        self.performTest(pairs)

    def test_h_to_kh(self):
        pairs = {
            'ле!гкість': 'ле!хкість',
            'сніг': 'сн\'іг',
        }
        self.performTest(pairs)

    def test_w(self):
        pairs = {
            'барв': 'барв',
            'вплив': 'у~плиу~',
            'вино!': 'вино!',
        }
        self.performTest(pairs)

    def test_z(self):
        pairs = {
            'зціли!ти': 'с\'ц\'іли!ти',
            'ка!зка': 'ка!зка',
            'розказа!ти': ('розказа!ти', 'росказа!ти'),
            'безпе!ка': ('беи^зпе!ка', 'беи^спе!ка'),
            # 2001!
            'розси!пати': 'рос:и!пати',
        }
        self.performTest(pairs)

    def test_odzvinchennia(self):
        pairs = {
            'боротьба!': 'бород\'ба!',
            'вокза!л': 'воґза!л',
        }
        self.performTest(pairs)

    def test_dz_dzh(self):
        pairs = {
            'джерело!': 'ДЖерело!',
            'дзеркало!': 'ДЗеркало!',
            # Не в 2001:
            #'віджима!ти': 'в`іДЖжима!ти',
            #'підзві!тний': 'піДЗзв`і!тний'
        }
        self.performTest(pairs)

    def test_mjakyj(self):
        pairs = {
            'лі!кар': 'л\'і!кар',
            'блок': 'блок',

            'ба!лка': 'ба!лка',
            'сип': 'сип',
            'верф': 'верф',
            'ма!ма': 'ма!ма',
            'біб': 'б`іб',
            'під': 'п`ід',
            'він': 'в`ін',
            'мій': 'м`ій',
            'фігура': 'ф`ігура',

            'ги!чка': 'ги!чка',
            'кит': 'кит',
            'хи!трий': 'хи!трий',
            'ґа!ва': 'ґа!ва',
            'гі!рко': 'г`і!рко',
            'хі!ба': 'х`і!ба',
            'ле!ґінь': 'ле!ґ`ін\'',

            'ча!ша': 'ча!ша',
            'джем': 'ДЖем',
            'шар': 'шар',
            'жах': 'жах',
            'о!чі': 'о!ч`і',
            'ло!джія': 'ло!ДЖ`ійа',
            'ші!сть': 'ш`іст\'',
            'жі!нка': 'ж`і!нка',

            'пала!ц': 'пала!ц',
            'ціпо!к': 'ц\'іпок',

            'ра!нок': 'ра!нок',
            'рі!чка': 'р`ічка',

            'дар': 'дар',
            'та!нок': 'та!нок',
            'нара!да': 'нара!да',
            'заграва': 'заграва',
            'сон': 'сон',
            'дзе!ркало': 'дзе!ркало',
            'дід': 'д\'ід',
            'тінь': 'т\'ін\'',
            'ніч': 'н\'іч',
            'зір': 'з\'ір',
            'сім': 'с\'ім',
            'дзьоб': 'дз\'об',
        }
        self.performTest(pairs)


    def test_double(self):
        pairs = {
            'щаве!ль': 'шчаве!л\'',

            'ярмо!': 'йармо!',
            'ю!шка': 'йу!шка',
            'єди!ний': 'йеи^ди!ний',
            'їжа!к': 'йіжа!к',

            'вʼя!з': 'вйа!з',
            'вʼюно!к': 'вйуно!к',
            'відʼє!мний': 'в`ідйе!мние^й',
            'підʼїзд': 'п\'ідйізд',

            'князь': 'кн\'аз\'',
            'люсте!рко': 'л\'усте!рко',
            'си!нє': 'си!н\'е',
        }
        self.performTest(pairs)

if __name__ == '__main__':
    unittest.main()
